proyectoGPS/app/controllers/api/positions_controller.rb

    def create

        # $user_id = params[:user_id]
        # $lat = params [:lat]
        # $lon = params [:lon]
        # $day = params [:day]
        # $hour = params [:hour]
        # @position = Position.new
        # @position.lat = $lat
        # @position.lon = $lon
        # @position.day = $day
        # @position.hour = $hour
        # @position.user_id = User.find($user_id)

        Position.create(position_params)
---
INSERT INTO "positions" ("user_id", "lat", "lon", "day", "hour", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["lat", "48.8583647"], ["lon", "2.2922993"], ["day", "2008-12-31"], ["hour", "13:00:59"], ["created_at", "2018-02-25 04:38:36.444875"], ["updated_at", "2018-02-25 04:38:36.444875"]]