proyectoGPS/app/controllers/positions_controller.rb

  def create
    Position.create(position_params)
---
INSERT INTO "positions" ("user_id", "lat", "lon", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["lat", "6.2023209999999995"], ["lon", "-75.58005639999999"], ["created_at", "2018-02-14 19:39:14.828413"], ["updated_at", "2018-02-14 19:39:14.828413"]]

  def show
    if params[:dia] == nil
      hoy = Date.today
    else
      hoy = DateTime.parse(params[:dia]) + 5.hour
    end
    @positions = current_user.positions.where(created_at: hoy..(hoy+1.day))
---
SELECT "positions".* FROM "positions" WHERE "positions"."user_id" = $1 AND ("positions"."created_at" BETWEEN $2 AND $3)  [["user_id", 1], ["created_at", "2018-02-14 05:00:00"], ["created_at", "2018-02-15 05:00:00"]]